{
  "WorkshopId": 2918134876,
  "Title": "Chill Populations",
  "Description": "This is a tiny mod that prevents certain creatures from appearing as villagers, converts, and so on.\n\nQud has a good few creatures that are disruptive to terrain or other creatures in the area - humors leave acid trails, newfathers spawn with slaves, segmented mirthworms duplicate themselves, and so on. Chill Populations applies blacklist tags to a bunch of these critters in an effort to keep them from causing shenanigans in the Stilt and other towns.\n\r\nSpecifically, this list includes:\n[list]\r\n[*]All turret tinkers and minelayers\n[*]All liquid weeps\n[*]All brooding puffers\n[*]Baetyls\n[*]Chrome idols\n[*]Chrome pyramids\n[*]Clonelings\n[*]Dromad traders (caravans and village traders are unaffected!)\n[*]Eyeless king crabs\n[*]Fire ant queens\n[*]Giant clams\n[*]Goatfolk shamans that spawn with escorts\n[*]Humors, including gyrohumors and panhumors\n[*]Mechanimist houndmasters\n[*]Molting basilisks\n[*]Newfathers\n[*]Seedsprout worms\n[*]Segmented mirthworms\n[*]Snailmothers\n[*]Snapjaw warlords that spawn with escorts\n[*]Worms of the earth\n[/list]\r\n\nThese creature types were hand-picked for disrupting the terrain or for spawning with other creatures near them; chrome idols always spawn with Naphtaali escorts for instance, and chrome pyramids have a forcefield that will dislocate walls. All other types of creatures are left in so as not to disrupt the intended feeling. Sapience isn't restricted to humanoids in Qud!\n\nYou can see the full list of creatures and fine-tune it to your liking in the mod's ObjectBlueprints.xml. The mod currently affects converts, villagers, hired guards, psychic thralls, pariahs, and sultan cultists (both in historical sites and in the Tomb of the Eaters.)\n\nFinally, you can find this mod's source code on  [url=https://github.com/Ilysen/ChillPopulations]GitHub[/url], under the MIT License.\n\n[b]Known issues:[/b]\n[list]\n[*]Restricted creatures still sometimes show up in villages. With how the logic works in the game's code this is really hard to fix, so it's gotta stay that way for now. Sometimes you get honey weeps and stuff as wardens. Oh well!\n[/list]",
  "Tags": "Balance",
  "Visibility": "2",
  "ImagePath": "preview.png"
}